var map = {
	"020602": "服务未注销导致项目删除失败",
	"020702": "实例名称已存在",
	"020802": "项目名称已存在,请重新输入",
	"020902": "英文名已存在,请重新输入",
	"021002": "实例名称已存在,请重新输入",
	"080802": "用户名已存在",
	"080902": "无权限修改密码",
	"080903": " 密码错误",
	"110201": "主机分组名重复",
	"110501": "指定分组下，该管理IP已存在,请重新输入",
	"110601": "指定分组下，该管理IP已存在,请重新输入",
	"120201": "指标分组名重复",
	"120501": "指标名重复",
	"120601": "指标名重复",
	"120901": "告警规则名称重复",
	"121001": "告警规则名称重复",
	"121401": "指标分组名称重复",
	"130201": "分组名称重复",
	"130301": "告警分组名称重复",
	"150201": "队列名称已存在,请修改",
	"150301": "该二级队列名称已存在,请修改",
	"150302": "队列资源不足,请调整",
	"150502": "资源不足，请检查二级队列资源已占用情况",
	"150503": "队列资源不足",
	"150602": "一级队列下有正在使用的二级队列，不能删除",
	"150603": "实例有其他操作，不能删除",
	"150604": "删除队列失败",
	"180201": "该参数名称已存在",
	"211701": "该实例名称已存在，请修改",
	"220201": "该应用名称已存在"
};

module.exports = function(code) {
	return map[code] || "服务器异常,请联系运维人员!";
}